<template>
	<view class="container">
		<h1>用户充值协议</h1>
		<p>本平台（下称“本平台”）用户充值协议（下称“本协议”）是本平台(下称“我们”）和服务使用人（下称“您”）就您按照本协议规定及我们不时发布的操作规则使用基于互联网的充值服务（下称“充值服务”)所签订的协议。
			为获得充值服务，请您认真阅读并充分知悉、理解本平台的各项规则及要求，以及国家关于该类互联网信息服务的法律法规等。<text>如果您对本协议的任何条款表示异议，您可以选择不使用充值服务；如您自主选择按照页面提示完成充值程序，即视为您将同意遵守本协议全部条款，以及我们后续对本协议随时所作的任何修改，并完全服从于我们的统一管理。本协议已对与您的权益具有或可能具有重大关系的条款，及对本平台具有或可能具有免责或限制责任的条款用粗体字予以标注，请您注意。
			</text></p>
		<p><text>【特别提示】您须确认自己具有完全民事行为能力，已年满18周岁，或已年满16周岁且依靠自己的劳动收入作为主要生活来源。本平台不鼓励未成年人使用相关服务，未成年人请委托监护人操作或在监护人明示同意下操作，否则不得使用本平台充值服务。请未成年人用户监护人切实履行其监护义务。对于未成年用户使用充值服务过程中的行为，以及因其使用充值服务而产生的一切后果本平台不承担任何责任。
			</text></p>
		<p><text>第1条
			</text>余额是我们向您提供的用于在本平台上进行相关消费的虚拟币，您可充值相应数量的余额。由于余额的特殊属性，致使充值服务不适用《消费者权益保护法》中有关反悔权及七日无理由退货等条款的约束。您一旦充值成功，本平台的充值服务即已提供完毕，本平台不提供任何退还或逆向兑换人民币服务。
		</p>
		<!-- <p><text>第3条 本协议最终解释权归属本团队。</text></p> -->
		<p><text>第2条 </text> 您务必根据自身实际需求充值相应数量的余额，您确认了解并接受在充值余额时页面所显示的余额价格。</p>
		<p><text>第3条
			</text>您可按照本平台充值页面上的相应提示完成充值程序，当我们通过第三方支付平台确认收到您为充值余额所支付的款项后，则视为您已完成充值相应数量余额的交易。充值成功后，充值所增加的账号内余额可由您在本平台上自由使用。
		</p>

		<p><text>第4条 </text>
			您的用户帐户中显示的余额或虚拟礼物余额并不构成现实世界的余额或反映任何存储值，而是构成对本平台服务中虚拟物品的许可范围的一种衡量。您无法将余额或虚拟礼物兑换为真实货币（包括但不限于人民币等）。
		</p>
		<p><text>第5条</text>
			本平台保留对使用人民币充值余额的规则进行单方面变更、调整、中止或终止的权利。您同意无条件接受对充值规则的变更、调整、中止或终止，本平台开展前述行动时，将在本平台公布的方式通知，并自公布之日起自动生效，而无需另行单独通知您，也不就该等行动给您造成的任何损失承担任何责任。
		</p>
		<!-- <table cellspacing='0' cellpadding="0">
		                <thead>
		                    <tr>
		                        <th>人民币</th>
		                        <th>余额</th>
		                    </tr>
		                </thead>
		                <tbody>
		                    <tr>
		                        <td>6元人民币</td>
		                        <td>42个“余额”</td>
		                    </tr>
		                    <tr>
		                        <td>30元人民币</td>
		                        <td>210个“余额”</td>
		                    </tr>
		                    <tr>
		                        <td>98元人民币</td>
		                        <td>686个“余额”</td>
		                    </tr>
		                </tbody>
		            </table> -->
		<!-- <p>您同意无条件接受对上述购买规则的变更、调整、中止或终止，本平台开展前述行动时，将在本平台公布的方式通知，并自公布之日起自动生效，而无需另行单独通知您，也不就该等行动给您造成的任何损失承担任何责任。
		            </p> -->
		<p><text>第6条</text>
			在使用充值服务时，您务必仔细确认自己的账号并仔细选择相关操作选项。若因为您自身输入账号错误、操作不当或不了解充值计费方式等因素造成充错账号、错选充值种类等情形而损害自身权益的，本平台将不会作出任何补偿或赔偿。
		</p>
		<p><text>第7条</text>
			若您以非法、欺诈或利用本平台漏洞的方式，或使用非本平台所指定的充值方式进行充值，本平台不保证该充值顺利或者正确完成。若因此造成您权益受损，本平台不会作出任何补偿或赔偿，本平台同时保留随时终止您本平台账号资格及使用各项充值服务的权利。
		</p>
		<p><text>第8条</text> 您不得通过本平台充值进行任何违法犯罪活动，否则本平台有权终止服务，情节严重的，依法移交司法机关。 </p>
		<p><text>第9条</text>
			如果本平台发现因系统故障或其他任何原因导致的充值处理错误，无论有利于本平台还是有利于您，本平台都有权在以合理方式通知您后纠正该错误。如果该错误导致您实际收到的余额数量少于您应获得的余额，则本平台在确认该处理错误后会尽快将差额补足至您的本平台账户中。如果该错误导致您实际收到的余额数量多于您应获得的余额，则无论错误的性质和原因如何，本平台有权从您的本平台账户中直接扣除差额。
		</p>
		<p><text>第10条 </text>您可随时在本平台上查看您的余额余额情况。如您对该记录有异议，应立即向本平台提出，本平台核对后确有错误的，将予以更正；否则您同意将本平台上的交易记录作为余额交易的唯一有效依据。
		</p>
		<p><text>第11条 </text> 本平台有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您了解，本平台的前述设定可能对您的交易造成一定不便，您对此没有异议。 </p>
		<p><text>第12条 </text>
			各充值方式对应的第三方渠道商可能会按其标准制定相关充值渠道手续费用（可能会在充值操作页面或渠道商其他页面上提示），并在充值余额时收取。请您务必注意各充值方式的渠道商服务手续费，并按自身需求选取充值方式。在任何情况下，对于您充值余额时涉及由第三方提供相关服务的责任由该第三方承担，本平台不承担该等责任。
		</p>
		<p><text>第13条 </text>
			您应确保您进行充值绑定的支付账户开户人/持有人，可合法、有效使用该账户且未侵犯任何第三方合法权益，否则因此造成账户实际所有人损失的，您应单独负责解决由此产生的纠纷并承担全部法律责任。您应确保用于充值余额的资金为个人合法财产，您利用该资金充值余额或消费虚拟礼物不存在任何违法犯罪目的；如您用于充值余额的资金被公安机关、检察院、法院等国家机关认定为非法资金（包括但不限于非法集资、职务侵占、挪用公款或贪污受贿等所得资金），并导致该等国家机关对我们的银行账户资金采取了冻结、强制执行等措施，您应赔偿我们因此而遭受的全部损失（包括但不限于被强制执行的全部金额及相应利息、为维权而支付的公证费、诉讼费、保全费、律师费、差旅费及鉴定费等）。
		</p>
		<p><text>第14条 </text> 因您自身的原因导致本平台无法提供余额充值服务或提供余额充值服务时发生任何错误而产生的任何损失或责任，由您自行负责，本平台不承担责任，包括但不限于：</p>
		<p>（1）您未按照《用户服务协议》或本协议或本平台不时公布的任何规则进行操作；<br />
			（2）因您的设备中本平台应用程序失效、丢失、被封停；<br />
			（3）因您绑定的第三方支付机构账户的原因导致的损失或责任，包括您使用未经认证的第三方支付账户或使用非您本人的第三方支付账户，您的第三方支付账户被冻结、查封等；<br />
			（4）您将密码告知他人导致的财产损失；</br>（5）因您个人的故意或重大过失或本协议之外的第三方所造成的您财产损失。</p>
		<p><text>第15条</text> 本平台系统因下列状况无法正常运作，使您无法使用各项服务或任何虚拟财产丢失时，本平台不承担损害赔偿责任，该状况包括但不限于：</p>
		<p>（1）在本平台公告之系统停机维护、升级、调整期间；<br />
			（2）电信通讯或设备出现故障不能进行数据传输的；<br />
			（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击、政府管制等不可抗力之因素，造成本平台系统障碍不能执行业务的；<br />
			（4）由于黑客攻击、电信部门技术调整或故障、网站升级、相关第三方的问题等原因而造成的服务中断或者延迟。</p>
		<p><text>第16条
			</text>在任何情况下，本平台均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害承担责任。本平台对您承担的全部责任，无论因何原因或何种行为方式，始终不超过您因使用本平台提供的充值服务而支付的费用。
		</p>
		<p><text>第17条</text> 如发生下列任何一种情形，本平台有权随时中断或终止向您提供本协议项下的网络服务而无需通知您，且无需承担因充值服务中断或终止而给您或第三方造成的损失的任何责任：</p>
		<p>（1）您提供的个人资料不真实；<br />
			（2）您违反本协议中规定的充值规则及保证内容；<br />
			（3）您违反《本平台服务协议》《社区公约》或其他本平台对用户的管理规定；<br />
			（4）您以营利、经营等非个人使用目的充值、使用余额。</p>
		<p>除前款所述情形外，本平台同时保留在不事先通知您的情况下随时中断或终止部分或全部网络充值服务的权利，对于充值服务的中断或终止而造成的任何损失，本平台无需对您或任何第三方承担任何责任。 </p>
		<p><text>第18条</text> 如果您违规使用非本人手机应用商店代充值，或者通过其它非本平台认可的渠道非法充值余额，则本平台有权冻结该账户，并进行相应惩罚，严重者可以进行封号处理。</p>
		<p><text>第19条</text>
			您在使用本平台时，如出现违反国家法律法规、《本平台服务协议》约定、本协议约定或其他本平台公布的协议或对用户的管理规定的情形，本平台有权暂时或永久封禁您的账号，且有权扣除本平台赠送/奖励的余额(如有)。账号封禁后至解禁（如有）前，您账户上的剩余余额将被暂时冻结或全部扣除，不可继续用于消费本平台上的虚拟产品或服务，同时不予返还您充值余额时的现金价值。
		</p>
		<p><text>第20条</text>
			本平台保留修改或增补本协议内容的权利。本协议的修改文本将公告于本平台或以其他本平台认为可行的方式公告。修改文本一旦公布则立即生效，且对生效前的您同样适用。若您在本协议内容发生修订后，继续使用本服务的，则视为您同意最新修订的协议内容；否则您须立即停止使用充值服务或本平台。
		</p>
		<p><text>第21条</text>
			凡因本协议所引起的或与之相关的任何争议､纠纷､分歧或索赔，包括协议的存在､效力､解释､履行､违反或终止，或因本协议引起的或与之相关的任何非协议性争议，本平台将与您协商解决。协商不成的，任何一方均有权向本协议签订地有管辖权的法院提起诉讼并适用中华人民共和国法律。
		</p>
		<p><text>第22条</text> 本协议部分内容被有管辖权的法院认定为违法或无效的，不因此影响其他内容的效力。本协议未涉及的问题参见国家有关法律法规，当本协议与国家法律法规冲突时，以国家法律法规为准。 </p>

		</section>

	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		onLoad() {

		},
		onShow() {

		},
		methods: {

		}
	}
</script>

<style lang="scss" scoped>
	.container {
		padding: 24rpx;
		box-sizing: border-box;

		text {
			font-weight: bold;
			text-indent: 2em;
			margin-right: 10rpx;
		}
	}
</style>
